<!-- dflook/terraform-github-actions {"workspace":"test-destroy-lock-info-2","backend_type":"remote","backend":"228909d28715be06b13952a8aa667a0fbb93653b08a0a5de30a096452e4b088b","plan_job_ref":"Job Test Terraform cloud #133 at https://github.com/dflook/terraform-github-actions/actions/runs/4031732501","plan_hash":"10ed97bf6e69bf80ccd8126da5c5cf10dc84d78ec226160b0df401bfa7220132","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __test-destroy-lock-info-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #133](https://github.com/dflook/terraform-github-actions/actions/runs/4031732501)